In [1]:
import pandas as pd
import numpy as np
np.random.seed(1)
from numpy import random

df = pd.DataFrame(random.randint(low=40, high=100, size=(5, 5)),
                         index=['Aaron', 'Bob', 'Charlie', 'Desmond', 'Elliot'],
                         columns=['Value1', 'Value2', 'Value3', 'Value4', 'Value5'])
df

         Value1  Value2  Value3  Value4  Value5
Aaron        77      83      52      48      49
Bob          51      45      55      40      56
Charlie      41      52      47      85      46
Desmond      65      90      60      77      58
Elliot       60      51      82      68      69

In [2]:
print("helo")

helo

In [6]:
import pandas as pd

dataframe = pd.read_csv('datasets/train.csv')
dataframe.head()

,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining_lease,resale_price
0,WOODLANDS,5 ROOM,9,MARSILING DR,16 TO 18,120,Standard,1976,57 years 10 months,355000
1,PASIR RIS,EXECUTIVE,101,PASIR RIS ST 12,01 TO 03,149,Maisonette,1988,68 years 08 months,580000
2,BUKIT BATOK,3 ROOM,135,BT BATOK WEST AVE 6,10 TO 12,68,New Generation,1984,64 years 06 months,262000
3,WOODLANDS,5 ROOM,553,WOODLANDS DR 44,10 TO 12,120,Improved,2000,80 years 05 months,438000
4,YISHUN,2 ROOM,459,YISHUN AVE 11,04 TO 06,48,Model A,2013,95 years,240000